#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

module.storage.random_password.master_password: Refreshing state... [id=none]
random_id.id: Refreshing state... [id=azVPCDQywJU]
module.backend.random_password.security_secret: Refreshing state... [id=none]
module.cf_key.random_id.id: Refreshing state... [id=UwXVXy0cOEg]
module.frontend.random_password.alb_header_value: Refreshing state... [id=none]
module.cf_key.data.archive_file.generate_value: Reading...
module.cf_key.data.archive_file.generate_value: Read complete after 0s [id=4a6d50bd45bc63137641df02062933f49902c886]
module.certificates.aws_acm_certificate.public_cert_frontend: Refreshing state... [id=arn:aws:acm:us-east-1:590184138762:certificate/e29d6d99-4d9c-49c6-9b59-64df6e8b29ad]
module.network.data.aws_availability_zones.available: Reading...
module.backend.aws_ssm_parameter.backend_storage_bucket_region: Refreshing state... [id=/hollybike/backend/Prod/storage_bucket_region]
module.backend.aws_ssm_parameter.backend_security_realm: Refreshing state... [id=/hollybike/backend/Prod/security_realm]
module.cf_key.data.aws_region.current: Reading...
module.backend.aws_ecs_cluster.default: Refreshing state... [id=arn:aws:ecs:eu-west-3:590184138762:cluster/HollyBike_ECSCluster_Prod]
module.domain.data.aws_route53_zone.public: Reading...
module.backend.aws_ssm_parameter.backend_db_username: Refreshing state... [id=/hollybike/backend/Prod/db_username]
module.network.aws_default_vpc.default: Refreshing state... [id=vpc-09e22d0b7792694bd]
module.frontend.aws_s3_bucket.bucket_frontend: Refreshing state... [id=hollybike-frontend20240416165220969300000004]
module.cf_key.data.aws_region.current: Read complete after 0s [id=eu-west-3]
module.backend.data.aws_iam_policy_document.task_assume_role_policy: Reading...
module.backend.data.aws_iam_policy_document.task_assume_role_policy: Read complete after 0s [id=1077804475]
module.backend.data.aws_ami.amazon_linux_2: Reading...
module.storage.aws_security_group.database_security_group: Refreshing state... [id=sg-0156ea3f82cc9d15e]
module.domain.data.aws_route53_zone.public: Read complete after 0s [id=Z02296662Z8OAJSQPYX9Q]
module.frontend.data.aws_cloudfront_cache_policy.disabled: Reading...
module.network.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-3]
module.backend.aws_secretsmanager_secret.backend_ghcr_credentials: Refreshing state... [id=arn:aws:secretsmanager:eu-west-3:590184138762:secret:HollyBike_BackGHCRCredsSecret_Prod-kMxHgT]
module.backend.aws_cloudwatch_log_group.log_group: Refreshing state... [id=/hollybike/ecs/backend]
module.frontend.data.aws_cloudfront_cache_policy.disabled: Read complete after 0s [id=4135ea2d-6df8-44a3-9df3-4b5a84be39ad]
module.backend.aws_ssm_parameter.backend_security_secret: Refreshing state... [id=/hollybike/backend/Prod/security_secret]
module.backend.data.aws_iam_policy_document.ec2_instance_role_policy: Reading...
module.backend.data.aws_iam_policy_document.ec2_instance_role_policy: Read complete after 0s [id=83011331]
module.cf_key.aws_iam_role.generate_value_exec: Refreshing state... [id=terraform-20240527125324857600000001]
module.backend.data.aws_ami.amazon_linux_2: Read complete after 1s [id=ami-0e8d5b147c5b27b0e]
module.storage.aws_s3_bucket.application_storage: Refreshing state... [id=hollybike-application-storage20240424171223531700000001]
module.frontend.aws_cloudfront_origin_access_identity.oai_frontend: Refreshing state... [id=EEPQ82BAG872]
module.cf_key.data.aws_caller_identity.current: Reading...
module.frontend.data.aws_cloudfront_origin_request_policy.all: Reading...
module.backend.data.aws_iam_policy_document.ecs_service_policy: Reading...
module.backend.data.aws_iam_policy_document.ecs_service_policy: Read complete after 0s [id=258469924]
module.cf_key.data.aws_partition.current: Reading...
module.cf_key.data.aws_partition.current: Read complete after 0s [id=aws]
module.backend.aws_ssm_parameter.backend_db_password: Refreshing state... [id=/hollybike/backend/Prod/db_password]
module.backend.aws_ssm_parameter.backend_security_domain: Refreshing state... [id=/hollybike/backend/Prod/security_domain]
module.backend.data.aws_iam_policy_document.ecs_service_role_policy: Reading...
module.backend.data.aws_iam_policy_document.ecs_service_role_policy: Read complete after 0s [id=4215153338]
module.backend.aws_ssm_parameter.backend_security_audience: Refreshing state... [id=/hollybike/backend/Prod/security_audience]
module.backend.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=HollyBike_ECS_TaskExecutionRole_Prod]
module.cf_key.data.aws_caller_identity.current: Read complete after 0s [id=590184138762]
module.backend.aws_iam_role.ecs_task_iam_role: Refreshing state... [id=HollyBike_ECS_TaskIAMRole_Prod]
module.frontend.data.aws_cloudfront_origin_request_policy.all: Read complete after 0s [id=216adef6-5c7f-47e4-b989-5492eafa07d3]
module.backend.data.template_file.user_data: Reading...
module.backend.data.template_file.user_data: Read complete after 0s [id=bab7f5f530d227c35f6a534441d0d7a8c68886385b7c386bfdf8b8f990d275ca]
module.storage.aws_db_instance.backend_db: Refreshing state... [id=db-JPQFLQH5KCR2G543OUCLHIOJ6M]
module.backend.aws_iam_role.ec2_instance_role: Refreshing state... [id=HollyBike_EC2_InstanceRole_Prod]
module.backend.aws_iam_role.ecs_service_role: Refreshing state... [id=HollyBike_ECS_ServiceRole_Prod]
module.backend.aws_secretsmanager_secret_version.backend_ghcr_credentials_version: Refreshing state... [id=arn:aws:secretsmanager:eu-west-3:590184138762:secret:HollyBike_BackGHCRCredsSecret_Prod-kMxHgT|terraform-20240527125325188300000003]
module.backend.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=HollyBike_ECS_TaskExecutionRole_Prod-20240416165223348000000008]
module.backend.aws_iam_instance_profile.ec2_instance_role_profile: Refreshing state... [id=HollyBike_EC2_InstanceRoleProfile_Prod]
module.backend.aws_iam_role_policy_attachment.ec2_instance_role_policy: Refreshing state... [id=HollyBike_EC2_InstanceRole_Prod-20240416165223268300000007]
module.cf_key.aws_iam_role_policy.generate_value: Refreshing state... [id=terraform-20240527125324857600000001:terraform-20240527125325882200000004]
module.certificates.aws_route53_record.frontend_validation["hollybike.fr"]: Refreshing state... [id=Z02296662Z8OAJSQPYX9Q__dfafb6d28e435f2a137807ba62d38865.hollybike.fr._CNAME]
module.cf_key.aws_lambda_function.generate_value: Refreshing state... [id=ssm-generated-value-module-5305d55f2d1c3848]
module.backend.aws_iam_role_policy.ecs_service_role_policy: Refreshing state... [id=HollyBike_ECS_ServiceRole_Prod:HollyBike_ECS_ServiceRolePolicy_Prod]
module.network.data.aws_internet_gateway.default: Reading...
module.network.aws_default_subnet.public[0]: Refreshing state... [id=subnet-0e4d65052f4bdb0bf]
module.network.aws_vpc_endpoint.secretsmanager_vpc_endpoint: Refreshing state... [id=vpce-02ae6a2853a311d44]
module.network.aws_default_subnet.public[1]: Refreshing state... [id=subnet-0705a2a5ccb8cdcd0]
module.network.aws_default_subnet.public[2]: Refreshing state... [id=subnet-0954c37944d0f9d91]
module.backend.aws_security_group.alb: Refreshing state... [id=sg-01c72bf0f862e920d]
module.certificates.aws_acm_certificate_validation.frontend: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.network.data.aws_internet_gateway.default: Read complete after 1s [id=igw-081351f9fed405c79]
module.network.aws_default_route_table.default: Refreshing state... [id=rtb-0d2e3d3555db3bea5]
module.backend.aws_ssm_parameter.backend_db_url: Refreshing state... [id=/hollybike/backend/Prod/db_url]
module.frontend.aws_s3_bucket_ownership_controls.bucket_frontend_acl_ownership: Refreshing state... [id=hollybike-frontend20240416165220969300000004]
module.frontend.aws_s3_bucket_public_access_block.public_block_frontend: Refreshing state... [id=hollybike-frontend20240416165220969300000004]
module.frontend.aws_s3_bucket_server_side_encryption_configuration.encrypt: Refreshing state... [id=hollybike-frontend20240416165220969300000004]
module.frontend.data.aws_iam_policy_document.bucket_policy_document_frontend: Reading...
module.frontend.data.aws_iam_policy_document.bucket_policy_document_frontend: Read complete after 0s [id=4105223510]
module.frontend.aws_s3_bucket_policy.bucket_frontend_policy: Refreshing state... [id=hollybike-frontend20240416165220969300000004]
module.backend.aws_security_group.ec2: Refreshing state... [id=sg-073ab2c919e4a8a0e]
module.backend.aws_alb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590184138762:loadbalancer/app/HollyBike-ALB-Prod/840c73eb4a50dda5]
module.cf_key.aws_lambda_invocation.generate_value: Refreshing state... [id=ssm-generated-value-module-5305d55f2d1c3848_$LATEST_c54556667729cf808b9fee6204b297f1]
module.cf_key.aws_cloudwatch_log_group.generate_value: Refreshing state... [id=/aws/lambda/ssm-generated-value-module-5305d55f2d1c3848]
module.frontend.aws_cloudfront_public_key.cf_key: Refreshing state... [id=KQSXZMCM1X2PL]
module.backend.aws_launch_template.ecs_launch_template: Refreshing state... [id=lt-0b69b23c0fbfdc1ff]
module.frontend.aws_cloudfront_key_group.object_signing_key_group: Refreshing state... [id=2734ce77-505c-4b8b-96fc-45a0a1a23016]
module.backend.aws_ssm_parameter.backend_security_cf_key_pair_id: Refreshing state... [id=/hollybike/backend/Prod/security_cf_key_pair_id]
module.backend.aws_autoscaling_group.ecs_autoscaling_group: Refreshing state... [id=HollyBike_ASG_Prod]
module.storage.aws_s3_bucket_ownership_controls.application_storage_acl_ownership: Refreshing state... [id=hollybike-application-storage20240424171223531700000001]
module.storage.aws_s3_bucket_public_access_block.public_block_application_storage: Refreshing state... [id=hollybike-application-storage20240424171223531700000001]
module.backend.aws_iam_role_policy.ecs_backend_task_iam_s3_role_policy: Refreshing state... [id=HollyBike_ECS_TaskIAMRole_Prod:HollyBike_ECS_S3_TaskIAMRole_Prod]
module.storage.data.aws_iam_policy_document.bucket_policy_document_application_storage: Reading...
module.backend.aws_ssm_parameter.backend_storage_bucket_name: Refreshing state... [id=/hollybike/backend/Prod/storage_bucket_name]
module.storage.aws_s3_bucket_server_side_encryption_configuration.encrypt: Refreshing state... [id=hollybike-application-storage20240424171223531700000001]
module.storage.data.aws_iam_policy_document.bucket_policy_document_application_storage: Read complete after 0s [id=2588265031]
module.storage.aws_s3_bucket_policy.bucket_frontend_policy: Refreshing state... [id=hollybike-application-storage20240424171223531700000001]
module.backend.aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590184138762:listener/app/HollyBike-ALB-Prod/840c73eb4a50dda5/7c9a27feaecaac0a]
module.backend.aws_alb_target_group.service_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590184138762:targetgroup/HollyBike-TargetGroup-Prod/b78c40601e60c77f]
module.backend.aws_ecs_capacity_provider.cas: Refreshing state... [id=arn:aws:ecs:eu-west-3:590184138762:capacity-provider/HollyBike_ECS_CapacityProvider_Prod]
module.frontend.aws_cloudfront_distribution.cf_dist_frontend: Refreshing state... [id=EN6L1ATP7UYB7]
module.backend.aws_iam_role_policy.ecs_backend_task_execution_ssm_role_policy: Refreshing state... [id=HollyBike_ECS_TaskExecutionRole_Prod:HollyBike_ECS_SSM_TaskIAMRole_Prod]
module.backend.aws_ecs_task_definition.default: Refreshing state... [id=HollyBike_ECS_TaskDefinition_Prod]
module.backend.aws_ecs_cluster_capacity_providers.cas: Refreshing state... [id=HollyBike_ECSCluster_Prod]
module.domain.aws_route53_record.frontend: Refreshing state... [id=Z02296662Z8OAJSQPYX9Q_hollybike.fr_A]
module.backend.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:eu-west-3:590184138762:service/HollyBike_ECSCluster_Prod/HollyBike_ECS_Service_Prod]
module.backend.aws_lb_listener_rule.header_condition: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-3:590184138762:listener-rule/app/HollyBike-ALB-Prod/840c73eb4a50dda5/7c9a27feaecaac0a/5df8881e6143f86b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.backend.aws_launch_template.ecs_launch_template will be updated in-place
  ~ resource "aws_launch_template" "ecs_launch_template" {
        id                                   = "lt-0b69b23c0fbfdc1ff"
      ~ latest_version                       = 12 -> (known after apply)
        name                                 = "HollyBike_EC2_LaunchTemplate_Prod"
        tags                                 = {}
      ~ user_data                            = "IyEvYmluL2Jhc2gNCg0KIyMgQ29uZmlndXJlIGNsdXN0ZXIgbmFtZSB1c2luZyB0aGUgdGVtcGxhdGUgdmFyaWFibGUgSG9sbHlCaWtlX0VDU0NsdXN0ZXJfUHJvZA0KDQplY2hvIEVDU19DTFVTVEVSPSdIb2xseUJpa2VfRUNTQ2x1c3Rlcl9Qcm9kJyA+PiAvZXRjL2Vjcy9lY3MuY29uZmln" -> "IyEvYmluL2Jhc2gKCiMjIENvbmZpZ3VyZSBjbHVzdGVyIG5hbWUgdXNpbmcgdGhlIHRlbXBsYXRlIHZhcmlhYmxlIEhvbGx5QmlrZV9FQ1NDbHVzdGVyX1Byb2QKCmVjaG8gRUNTX0NMVVNURVI9J0hvbGx5QmlrZV9FQ1NDbHVzdGVyX1Byb2QnID4+IC9ldGMvZWNzL2Vjcy5jb25maWc="
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.backend.aws_secretsmanager_secret_version.backend_ghcr_credentials_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "backend_ghcr_credentials_version" {
      ~ arn            = "arn:aws:secretsmanager:eu-west-3:590184138762:secret:HollyBike_BackGHCRCredsSecret_Prod-kMxHgT" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:eu-west-3:590184138762:secret:HollyBike_BackGHCRCredsSecret_Prod-kMxHgT|terraform-20240527125325188300000003" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240527125325188300000003" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.backend.aws_ssm_parameter.backend_security_cf_key_pair_id will be updated in-place
  ~ resource "aws_ssm_parameter" "backend_security_cf_key_pair_id" {
        id              = "/hollybike/backend/Prod/security_cf_key_pair_id"
      + insecure_value  = (known after apply)
        name            = "/hollybike/backend/Prod/security_cf_key_pair_id"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.cf_key.aws_lambda_function.generate_value will be updated in-place
  ~ resource "aws_lambda_function" "generate_value" {
        id                             = "ssm-generated-value-module-5305d55f2d1c3848"
      ~ last_modified                  = "2024-05-27T12:59:12.544+0000" -> (known after apply)
      ~ source_code_hash               = "trf8E067tpqS1F73KvNTCEXaiTptBJ0IW/NPkVxviXs=" -> "VEVffGociLS8qTPS7dFRcb3EJFpzfVDRuUinANQNJmA="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cf_key.aws_lambda_invocation.generate_value will be replaced due to changes in replace_triggered_by
-/+ resource "aws_lambda_invocation" "generate_value" {
      ~ id              = "ssm-generated-value-module-5305d55f2d1c3848_$LATEST_c54556667729cf808b9fee6204b297f1" -> (known after apply)
      ~ result          = jsonencode(
            {
              - publicKey = <<-EOT
                    -----BEGIN PUBLIC KEY-----
                    MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAynIISECkMvQeP97+t67S
                    irlQFmzpGt//KjK3opv8oUBcSlDITCVqIBdDIPl/CfwtSZb7nzVEDetQsflqwcmq
                    BBqbMEYjUwEn3wqJO6aBThxwAlJLxRFPw5ZPjThzYwqvRCPVetrmlueaE/ni0Ivi
                    JLdzHfmUm8rWNv2E4dJJ+fFHm4l/W0DOr3DRfn1ktH82i3dDJPlejL1C3azAVjAT
                    MvrbeHiS9/4scDIY890vKjai5xOyJjJjWEmeaqOevoIS42XNc34PzjVyVJEFEzZ0
                    PFUYnAPpwLjb7xpJfZd3MTk0GLe5zKMxA25hqoQ+HjdqaOHILnBcdoGlJ1hQj10A
                    TwIDAQAB
                    -----END PUBLIC KEY-----
                EOT
            }
        ) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.frontend.aws_cloudfront_key_group.object_signing_key_group will be updated in-place
  ~ resource "aws_cloudfront_key_group" "object_signing_key_group" {
        id      = "2734ce77-505c-4b8b-96fc-45a0a1a23016"
      ~ items   = [
          - "KQSXZMCM1X2PL",
        ] -> (known after apply)
        name    = "object-keys"
        # (2 unchanged attributes hidden)
    }

  # module.frontend.aws_cloudfront_public_key.cf_key must be replaced
-/+ resource "aws_cloudfront_public_key" "cf_key" {
      ~ caller_reference = "terraform-20240527132106613900000001" -> (known after apply)
      ~ encoded_key      = <<-EOT # forces replacement
            -----BEGIN PUBLIC KEY-----
            MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAynIISECkMvQeP97+t67S
            irlQFmzpGt//KjK3opv8oUBcSlDITCVqIBdDIPl/CfwtSZb7nzVEDetQsflqwcmq
            BBqbMEYjUwEn3wqJO6aBThxwAlJLxRFPw5ZPjThzYwqvRCPVetrmlueaE/ni0Ivi
            JLdzHfmUm8rWNv2E4dJJ+fFHm4l/W0DOr3DRfn1ktH82i3dDJPlejL1C3azAVjAT
            MvrbeHiS9/4scDIY890vKjai5xOyJjJjWEmeaqOevoIS42XNc34PzjVyVJEFEzZ0
            PFUYnAPpwLjb7xpJfZd3MTk0GLe5zKMxA25hqoQ+HjdqaOHILnBcdoGlJ1hQj10A
            TwIDAQAB
            -----END PUBLIC KEY-----
        EOT -> (known after apply) # forces replacement
      ~ etag             = "E3L6V2W1N5XURR" -> (known after apply)
      ~ id               = "KQSXZMCM1X2PL" -> (known after apply)
        name             = "object-signing-key"
      + name_prefix      = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 4 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Loic-Vanden-Bossche, Action: `pull_request`*